In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os
%matplotlib inline

In C:\Users\adars_000\anaconda3\lib\site-packages\matplotlib\mpl-data\stylelib\_classic_test.mplstyle:
The text.latex.preview rcparam was deprecated in Matplotlib 3.3 and will be removed two minor releases later.
In C:\Users\adars_000\anaconda3\lib\site-packages\matplotlib\mpl-data\stylelib\_classic_test.mplstyle:
The mathtext.fallback_to_cm rcparam was deprecated in Matplotlib 3.3 and will be removed two minor releases later.
In C:\Users\adars_000\anaconda3\lib\site-packages\matplotlib\mpl-data\stylelib\_classic_test.mplstyle: Support for setting the 'mathtext.fallback_to_cm' rcParam is deprecated since 3.3 and will be removed two minor releases later; use 'mathtext.fallback : 'cm' instead.
In C:\Users\adars_000\anaconda3\lib\site-packages\matplotlib\mpl-data\stylelib\_classic_test.mplstyle:
The validate_bool_maybe_none function was deprecated in Matplotlib 3.3 and will be removed two minor releases later.
In C:\Users\adars_000\anaconda3\lib\site-packages\matplotlib\mpl-data\stylelib\_classic_test.mplstyle:
The savefig.jpeg_quality rcparam was deprecated in Matplotlib 3.3 and will be removed two minor releases later.
In C:\Users\adars_000\anaconda3\lib\site-packages\matplotlib\mpl-data\stylelib\_classic_test.mplstyle:
The keymap.all_axes rcparam was deprecated in Matplotlib 3.3 and will be removed two minor releases later.
In C:\Users\adars_000\anaconda3\lib\site-packages\matplotlib\mpl-data\stylelib\_classic_test.mplstyle:
The animation.avconv_path rcparam was deprecated in Matplotlib 3.3 and will be removed two minor releases later.
In C:\Users\adars_000\anaconda3\lib\site-packages\matplotlib\mpl-data\stylelib\_classic_test.mplstyle:
The animation.avconv_args rcparam was deprecated in Matplotlib 3.3 and will be removed two minor releases later.

In [10]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),columns=['a','b','c'])
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns = ['a','b','c','d','e'])

In [11]:
df1 + df2

      a     b     c   d   e
0   0.0   2.0   4.0 NaN NaN
1   8.0  10.0  12.0 NaN NaN
2  16.0  18.0  20.0 NaN NaN
3   NaN   NaN   NaN NaN NaN

In [8]:
df1.loc[0]

a    0.0
b    1.0
c    2.0
d    3.0
Name: 0, dtype: float64

In [9]:
df1.iloc[[2]]

     a    b     c     d
2  8.0  9.0  10.0  11.0

In [12]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   3.0   4.0
1   8.0  10.0  12.0   8.0   9.0
2  16.0  18.0  20.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [13]:
df1+df2

      a     b     c   d   e
0   0.0   2.0   4.0 NaN NaN
1   8.0  10.0  12.0 NaN NaN
2  16.0  18.0  20.0 NaN NaN
3   NaN   NaN   NaN NaN NaN

In [14]:
1/df1

          a         b      c
0       inf  1.000000  0.500
1  0.333333  0.250000  0.200
2  0.166667  0.142857  0.125

In [15]:
df1.rdiv(1)

          a         b      c
0       inf  1.000000  0.500
1  0.333333  0.250000  0.200
2  0.166667  0.142857  0.125

In [16]:
# using columns from another table reindexing.

df1.reindex(columns = df2.columns, fill_value = 0)

     a    b    c  d  e
0  0.0  1.0  2.0  0  0
1  3.0  4.0  5.0  0  0
2  6.0  7.0  8.0  0  0

In [17]:
arr = np.arange(12.).reshape(3,4)

In [18]:
arr[0]

array([0., 1., 2., 3.])

In [19]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [21]:
data = {'state':['ohio','nevada','utah','oregon'],
        'pop':[1.2,2.5,0.8,1.3],
       'year':[1998,2001,2002,1999]}

frame = pd.DataFrame(data)
frame

    state  pop  year
0    ohio  1.2  1998
1  nevada  2.5  2001
2    utah  0.8  2002
3  oregon  1.3  1999

In [22]:
series = frame.iloc[0]
series

state    ohio
pop       1.2
year     1998
Name: 0, dtype: object

In [29]:
series1 = frame.iloc[0]
series1

state    ohio
pop       1.2
year     1998
Name: 0, dtype: object

In [30]:
series1

state    ohio
pop       1.2
year     1998
Name: 0, dtype: object

In [32]:
# Function Application and Mapping

frame = pd.DataFrame (np.random.randn(4,3), columns = ['b','d','e'],
                     index = ['utah','ohio','nevada','florida'])
frame

                b         d         e
utah     0.164036  0.103117  0.312613
ohio     1.550089  0.837329  1.540854
nevada   1.024223 -0.013218  0.223476
florida  0.168770 -1.045476  2.268305

In [33]:
np.abs(frame)

                b         d         e
utah     0.164036  0.103117  0.312613
ohio     1.550089  0.837329  1.540854
nevada   1.024223  0.013218  0.223476
florida  0.168770  1.045476  2.268305

In [34]:
f = lambda x: x.max() - x.min()

In [35]:
frame.apply(f)

b    1.386053
d    1.882805
e    2.044829
dtype: float64

In [36]:
frame.apply(f, axis = 'columns')

utah       0.209496
ohio       0.712761
nevada     1.037441
florida    3.313782
dtype: float64

In [38]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['xmin','xmax'])

frame.apply(f)

             b         d         e
xmin  0.164036 -1.045476  0.223476
xmax  1.550089  0.837329  2.268305

In [44]:
format = lambda x : '%.2f' % x
frame.applymap(format)

            b      d     e
utah     0.16   0.10  0.31
ohio     1.55   0.84  1.54
nevada   1.02  -0.01  0.22
florida  0.17  -1.05  2.27

In [47]:
#Sorting and Ranking

obj = pd.Series(range(4), index = ['b','d','c','a'])
obj

b    0
d    1
c    2
a    3
dtype: int64

In [48]:
obj.sort_index()

a    3
b    0
c    2
d    1
dtype: int64

In [51]:
frame1 = pd.DataFrame(np.arange(12).reshape(3,4),
                     index=['utah','ohio','nevada'],
                     columns = ['b','d','a','c'])
frame1

        b  d   a   c
utah    0  1   2   3
ohio    4  5   6   7
nevada  8  9  10  11

In [55]:
frame1.sort_index()

        b  d   a   c
nevada  8  9  10  11
ohio    4  5   6   7
utah    0  1   2   3

In [59]:
obj = pd.Series([2,np.nan,-1,4,np.nan,3])
obj.sort_values()

2   -1.0
0    2.0
5    3.0
3    4.0
1    NaN
4    NaN
dtype: float64

In [67]:
frame = pd.DataFrame({'b':[-1,2,4,3], 'c':[3,-2,5,0], 'd':[0,2,4,3]})
frame

   b  c  d
0 -1  3  0
1  2 -2  2
2  4  5  4
3  3  0  3

In [68]:
frame.sort_values(by = ['b','d','c'])

   b  c  d
0 -1  3  0
1  2 -2  2
3  3  0  3
2  4  5  4

In [69]:
#The rank methods for Series and DataFrame are the place to look; by default rank
#breaks ties by assigning each group the mean rank:


obj = pd.Series([1,6,2,8,3,5])
obj.rank()

0    1.0
1    5.0
2    2.0
3    6.0
4    3.0
5    4.0
dtype: float64

In [71]:
# axis indexes with duplicate labels

obj = pd.Series(range(5), index = ['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [73]:
obj.index.is_unique

False

In [74]:
obj['a']

a    0
a    1
dtype: int64

In [76]:
obj.index

Index(['a', 'a', 'b', 'b', 'c'], dtype='object')

In [78]:
# Summarizing and computing descriptive statistics

df = pd.DataFrame([[1,2],[3,np.nan],[np.nan,4],[np.nan,np.nan]],
                 index = ['one','two','three','four'],
                 columns = ['A','B'])
df

         A    B
one    1.0  2.0
two    3.0  NaN
three  NaN  4.0
four   NaN  NaN

In [81]:
df.sum(axis = 'columns')

one      3.0
two      3.0
three    4.0
four     0.0
dtype: float64

In [82]:
df.describe()

              A         B
count  2.000000  2.000000
mean   2.000000  3.000000
std    1.414214  1.414214
min    1.000000  2.000000
25%    1.500000  2.500000
50%    2.000000  3.000000
75%    2.500000  3.500000
max    3.000000  4.000000

In [83]:
import pandas_datareader.data as web

ModuleNotFoundError: No module named 'pandas_datareader'